[
    {
        "title": "Sr Principal Engineer Software Quality",
        "company": "Northrop Grumman - 4.0",
        "location": "Northridge, CA",
        "link": "https://www.simplyhired.com/out?r=u0W7c3lXo572kmod6gznyo-DJ8Jsx1LQBmSr0fKCVL4g55astlVNozpTpUfkSwwSH7lqjH58IO-vrVPb4VVWHs3Yc5UufZ6oJhke4piSt3pr7efWbt_UWb5SMMNY25sItyRRGmjvHx04KkBSAEk_9DCKMfKwBPqELfZh03AAybWj0CM8SrVfmnO6cHldvzKHEVv8fulHTmseZ-w2C-k_V3DNGuN7O7JjQIuWij5_aOBFFXHcvwSWeuqulO-hyMVv0gMtlabGze3z",
        "Estimated Salary": "$120,900 - $181,300 a year",
        "description": "Requisition ID: R10146524\nCategory: Engineering\nLocation: Northridge, California, United States of America\nCitizenship required: United States Citizenship\nClearance Type: Secret\nTelecommute: No- Teleworking not available for this position\nShift: 1st Shift (United States of America)\nTravel Required: Yes, 50% of the Time\nRelocation Assistance: Relocation assistance may be available\nPositions Available: 1\nAt Northrop Grumman, our employees have incredible opportunities to work on revolutionary systems that impact people's lives around the world today, and for generations to come. Our pioneering and inventive spirit has enabled us to be at the forefront of many technological advancements in our nation's history - from the first flight across the Atlantic Ocean, to stealth bombers, to landing on the moon. We look for people who have bold new ideas, courage and a pioneering spirit to join forces to invent the future, and have fun along the way. Our culture thrives on intellectual curiosity, cognitive diversity and bringing your whole self to work — and we have an insatiable drive to do what others think is impossible. Our employees are not only part of history, they're making history.\nAt Northrop Grumman, our employees have incredible opportunities to work on revolutionary systems that impact people's lives around the world today, and for generations to come. Our pioneering and inventive spirit has enabled us to be at the forefront of much technological advancement in our nation's history from the first flight across the Atlantic Ocean, to stealth bombers, to landing on the moon. We look for people who have bold new ideas, courage and a pioneering spirit to join forces to invent the future, and have fun along the way. Our culture thrives on intellectual curiosity, cognitive diversity and bringing your whole self to work and we have an insatiable drive to do what others think is impossible. Our employees are not only part of history, they're making history.\nJob Summary\nNorthrop Grumman Defense Systems is seeking a Software Quality Engineer to join our team of qualified, diverse individuals at our Northridge, CA location. The qualified applicant will become part of Northrop Grumman's Software Quality Engineering team that is engaged with cutting edge technology on a dynamic portfolio of advanced weapons. The Software Quality Engineer performs tasks that contribute to the completion of program execution for one or more programs to meet the requirements of the contracts and business.\nQualified candidates work as part of a team, demonstrate a high level of attention to detail, possess the ability to plan ahead and be customer-support focused. Individuals must also have demonstrated ability to evaluate whether documents, instructions and procedures are being followed during execution and demonstrate strong verbal and written communication skills.\nResponsibilities include:\nRepresent Software Quality Assurance for all software/firmware/Programmable Logic Device (PLD) development activities\nInterface with manufacturing, engineering, customer, supplier, and subcontractor representatives to ensure requirements are met\nParticipate in software/firmware /PLD design reviews, defect reviews and code reviews\nReview software/firmware/PLD design, specifications, and plans for compliance to contract and process requirements\nParticipate in test witnessing including preparations for test events, test monitoring, sign-off on final test reports, and surveillance of integration and testing labs and their activities\nReview, analyze and report on software/firmware /PLD quality discrepancies related to the product(s) being delivered\nReview/approve contract deliverables for accuracy and compliance to contract requirements\nPerform internal audits to company/program requirements and industry standards\nInvestigate problems and recommend preventative/corrective actions, dispositions and modifications\nBasic Qualifications:\nBachelor’s Degree in a related STEM field from an accredited university\n9+ years of industry experience in Software Quality Assurance\nAdditional industry experience within one or more areas: quality, auditing, manufacturing, engineering and/or software-related field\nAdvanced understanding of CMMI and ISO9001/AS9100 standards\nWorking knowledge of Microsoft Office Tools\nStrong interpersonal skills\nHolds Interim Secret or Active Secret DoD Security Clearance (US Citizenship required)\nPreferred Qualifications:\nExperience working within various software/firmware /PLD development lifecycles\nExperience translating high level product requirements into software/firmware requirements and specifications\nExperience validating/testing software/firmware for compliance to contract requirements and specifications\nExperience working with suppliers in defining software/firmware requirements and test cases\nExperience validating supplier’s testing of software/firmware run on embedded systems\nFamiliar with object-oriented programming languages, such as JAVA, C++, C#, Ada, or VHDL\nFamiliar with various scripting languages and CM tools, such as JIRA, Python, and MATLAB\nFamiliar with firmware debugging, including analysis of results and regression testing\nFamiliar with version and configuration control of programming files, especially when supplier furnished\nSalary Range: $120,900 - $181,300\nThe above salary range represents a general guideline; however, Northrop Grumman considers a number of factors when determining base salary offers such as the scope and responsibilities of the position and the candidate's experience, education, skills and current market conditions.\n\nEmployees may be eligible for a discretionary bonus in addition to base pay. Annual bonuses are designed to reward individual contributions as well as allow employees to share in company results. Employees in Vice President or Director positions may be eligible for Long Term Incentives. In addition, Northrop Grumman provides a variety of benefits including health insurance coverage, life and disability insurance, savings plan, Company paid holidays and paid time off (PTO) for vacation and/or personal business.\nNorthrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit http://www.northropgrumman.com/EEO. U.S. Citizenship is required for most positions."
    },
    {
        "title": "JAVA Developers - SDET Engineers - Online Training and Hire",
        "company": "TechBee Solutions",
        "location": "Minneapolis, MN",
        "link": "https://www.simplyhired.com/out?r=rDRv6nWN9OmQIwNk-BX46GPTuD-ICWLRR7loth9Sn3dBUpbR2gPYFv7XryUo5B4LKmP0KwpHEf3sr9hQZxOsexSFZ5_tQTPjtsapXOHfP25Gec1tPMIp-q0ZnT1UVRA4faLAvwOjeLjD0nVyDBbYO8PLRMwcMBhBclyIKuuM6Uljhg",
        "Estimated Salary": "$35 an hour",
        "description": "Job Description:\nTechbee Solutions, Inc is currently looking for highly motivated candidates majored in Computer Science, Business Computer Information Systems (BCIS) and/or Masters in Information Systems (MIS) and who wants to pursue their career as JAVA SDET Engineers.\nWhy Techbee LLC?\nQuick placement with our Direct Clients, Prime Vendors and Fortune 500 clients on long-term projects\nFree Online training with real time experienced JAVA Developers with 15 years of industry experience\nCompetitive compensation offered as per the industry standards\nReal time Projects and Assignments\nEvaluation and monitoring of progress by administering tests\nOn-job support while you are on projects\n1 on 1 Mock-Interviews and Interview tips\nAn e-verified company\nGC sponsorships for H1B candidates\nWhat is Techbee LLC?\nTechbee, LLC is a full service staffing and placement firm servicing clients in Northern America. We are dedicated towards fulfilling the IT needs of our clients by providing excellent candidates and also full implementation of projects from initial stages to production deployment. We are equal opportunity employer and provide opportunities irrespective of age, race, religion, sex and legal status. We provide excellent career opportunities for Fresh Graduates and Experienced Professionals. Our employee benefits package is one of the best in the market.\nTechbee, LLC specializes in JAVA Developer - SDETs (Software Developer in Test) job placement and training. The extensive training curriculum covers full range of development (JAVA Programming) and testing techniques. After completing our JAVA - SDET training, you will possess the knowledge and extensive experience to design and develop powerful applications and test frameworks.\nWhat are we looking for?\nBachelors or Master’s Degree student from an accredited university (Computer Science/ Information Technology/MIS).\nCandidates who want to make a career in Software Development/ Testing\nWilling to relocate anywhere in the US\nEntry-level skills to understand any programming language.\nGood Analytical skills.\nExcellent Communication skills\nExcellent interpersonal skills.\nBachelors / Masters in any computer related field is preferred.\nCandidates with GC/USC/OPT EAD/EAD/TN Visas are accepted\nBasic Skills in Core Java, Python, Javascript, SQL Server (Proficiency in on programming language)\nAnyone who would like to quick start their career in Information Technology/ Computer Programming\nJob Types: Full-time, Contract\nPay: $35.00 per hour\nBenefits:\nDental insurance\nHealth insurance\nVision insurance\nCompensation package:\nHourly pay\nExperience level:\n1 year\nSchedule:\n8 hour shift\nExperience:\nSelenium: 1 year (Preferred)\nTest automation: 1 year (Preferred)\nJava: 1 year (Preferred)\nWork Location: In person"
    },
    {
        "title": "Associate Software Engineer – MQ-25 Flight Simulation",
        "company": "BOEING - 3.9",
        "location": "Hazelwood, MO",
        "link": "https://www.simplyhired.com/out?r=ddWulPmYdGp3kMVRz-7RZt0B6wC0X4tm-UXXWwT4ciwNvZX3A76XRX4dAaMwXifptYZgKPi6P2Va-fg",
        "Estimated Salary": "$85,000 - $115,000 a year",
        "description": "Job Description\nAt Boeing, we innovate and collaborate to make the world a better place. From the seabed to outer space, you can contribute to work that matters with a company where diversity, equity and inclusion are shared values. We’re committed to fostering an environment for every teammate that’s welcoming, respectful and inclusive, with great opportunity for professional growth. Find your future with us.\nThe Boeing Company is looking for an Associate Software Engineer (Level 2) to join the MQ-25 Flight Simulations Software team in Hazelwood, MO. (St. Louis, MO) This position will focus on supporting the Boeing Defense, Space & Security (BDS) business organization.\n\nThe MQ-25A Stingray will be the world’s first operational, carrier-based unmanned aircraft and pioneer the integration of manned and unmanned systems within the U.S. Navy carrier air wing. The MQ-25 will allow for better use of combat strike fighters by extending the range of deployed Boeing F/A-18 Super Hornet, Boeing EA-18G Growler, and Lockheed Martin F-35C aircraft. The MQ-25 will also seamlessly integrate with a carrier’s catapult and launch and recovery systems.\n\nThis position supports the development and test of the aircraft software and avionics via use of simulation environments, architectures, and modeling of aircraft subsystems. The Flight Simulation Labs team is responsible for the desktop test environment and hardware in the loop laboratories. Engineers will work as part of a scaled agile software team and interface with multiple other engineering teams. Becoming a Flight Simulation Labs team member is a great way to learn aircraft architecture, systems, and processes.\n\nWe are looking for engineers who want challenging and unique opportunities to support flight simulation for the MQ-25, the world’s first operational, carrier-based unmanned aircraft .\n\nJoin Us. Build the Future.\n\nBoeing offers a comprehensive benefits package including generous Paid Time Off (PTO), flexible work environment , paid parental leave, 401k matching, very generous tuition assistance for earning advanced degrees, and paid medical leave programs. For more information, click here .\n\nPosition Responsibilities :\nAssists with the development, documentation and maintenance of architectures, requirements, algorithms, interfaces, and designs for software systems.\n\nDevelops and maintains code and integrates software components into a fully functional software system.\n\nAssists with test procedures and documenting test results to ensure software system requirements are met.\n\nSupports software project management and software supplier management functions.\n\nSelects, tailors, and deploys processes and tools; establishes metrics.\n\nPerforms software research and trade studies.\n\nTroubleshoots software and hardware issues.\n\nWorks under general direction.\n\nThis position is expected to be 100% onsite. The selected candidate will be required to work onsite at one of the listed location options. (Berkeley, MO)\n\nThis position requires the ability to obtain a US Security Clearance for which the US Government requires US Citizenship. An interim and/or final U.S. Secret Clearance Post-Start is required.\n\nBasic Qualifications (Required Skill/Experience) :\nBachelor, Master or Doctorate of Science degree from an accredited course of study, in Computer Engineering, Software Engineering, Computer Science, Mathematics, Physics or other technical degree\n\n2+ years of professional experience with C, C++, C#, Python, Java, or Ada\n\n1+ year of experience in hardware and software integration\n\nPreferred Qualifications (Desired Skills/Experience) :\nExperience with Git\n\nExperience with networking protocols or packet analysis tools, such as Wireshark\n\nExperience working on an Agile team using Agile methodologies and tools such as Jira\n\nStrong coordination and communication skills\n\nAbility to work in a multi-tasking environment while supporting multiple concurrent activities\n\nAbility to work effectively in a collaborative team environment\n\nTypical Education/Experience :\nEducation/experience typically acquired through advanced technical education from an accredited course of study in engineering, computer science, mathematics, physics or chemistry (e.g. Bachelor) and typically 2 or more years' related work experience or an equivalent combination of technical education and experience (e.g. Master). In the USA, ABET accreditation is the preferred, although not required, accreditation standard.\n\nTravel:\nOccasional travel may be required but would be less than 10%.\n\nRelocation :\nThis position offers relocation based on candidate eligibility. Note : Basic relocation will be offered for eligible internal candidates.\n\nShift:\nThis position is for 1st shift.\n\nDrug Free Workplace :\nBoeing is a Drug Free Workplace where post offer applicants and employees are subject to testing for marijuana, cocaine, opioids, amphetamines, PCP, and alcohol when criteria is met as outlined in our policies.\n\nAt Boeing, we strive to deliver a Total Rewards package that will attract, engage and retain the top talent. Elements of the Total Rewards package include competitive base pay and variable compensation opportunities.\nThe Boeing Company also provides eligible employees with an opportunity to enroll in a variety of benefit programs, generally including health insurance, flexible spending accounts, health savings accounts, retirement savings plans, life and disability insurance programs, and a number of programs that provide for both paid and unpaid time away from work.\nThe specific programs and options available to any given employee may vary depending on eligibility factors such as geographic location, date of hire, and the applicability of collective bargaining agreements.\nPlease note that the salary information shown below is a general guideline only . Pay is based upon candidate experience and qualifications, as well as market and business considerations.\n\nSummary pay range: $85,000 – $115,000\nExport Control Requirements: U.S. Government Export Control Status: This position must meet export control compliance requirements. To meet export control compliance requirements, a “U.S. Person” as defined by 22 C.F.R. §120.15 is required. “U.S. Person” includes U.S. Citizen, lawful permanent resident, refugee, or asylee.\n\nExport Control Details: US based job, US Person required\n\nEqual Opportunity Employer:\nBoeing is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, physical or mental disability, genetic factors, military/veteran status or other characteristics protected by law."
    },
    {
        "title": "Software Engineer",
        "company": "Akamai - 4.1",
        "location": "United States",
        "link": "https://www.simplyhired.com/out?r=9zh76uTP32D9t7TBjDCNlL5usNA0HEv1l8LtKnC-BpKPOOn8dPqW7eFILY_r5mDAw6G5raPIrdg3UpW3utceLCNXzHeVnNtf8Jy-tlhJG1R-cxbZRnqpIsroseKodV0sUCUnG1efAUO-1jq5_y_Bk3w",
        "Estimated Salary": "$77,487 - $116,021 a year",
        "description": "Are you excited by the opportunity to develop and produce exciting tools?\nAre you a fast learner who is fascinated by technology?\nGrow with our Advanced Data and Visualization Team\nThe Advanced Data and Visualization team builds bespoke dashboards and solutions that are used by Akamai's top leaderships to demonstrate Akamai's value to customers and prospect. These solutions will ultimately tie in to story we want to tell our customers, and the impact we make every day to our end-users.\nPartner with the best\nYou will be build high-performing, asynchronous and multi-threaded web services in Java/Python. Work with existing tools and systems to retrieve and store critical data points in a time-sensitive manner. Agility, versatility and ability to shift between technologies will be part of the job, while following SDLC and the best industry practices.\nAs a Software Engineer, you will be responsible for:\nBuilding backend solutions that process complex data streams and expose data through high-performing, reliable interfaces\nWorking with stakeholders on appropriate features and fixes that improve performance, reliability, and overall user experience.\nCreating and enhancing new features and functionality, including conception, design, development, testing and deployment\nCollaborating across teams and stakeholders in different time zones to integrate and deliver the features on time\nDo what you love\nTo be successful in this role you will:\nHave Bachelor's degree in CSE and 2 years experience in back-end Engineering\nDemonstrate wide experience in writing modular, framework-quality code in Python, Java or equivalent.\nHave experience with databases like PostgreSQL, Oracle or MySQL\nHave familiarity with Linux, Bash and command line tools.\nExperience with one or more web development middleware/frameworks: Spring Boot, Hibernate, Struts, GWT, Django, Flask, etc.\nHave an understanding of HTTP, REST, and web server technologies that will support frontend development\nWork in a way that works for you\nFlexBase, Akamai's Global Flexible Working Program, is based on the principles that are helping us create the best workplace in the world. When our colleagues said that flexible working was important to them, we listened. We also know flexible working is important to many of the incredible people considering joining Akamai. FlexBase, gives 95% of employees the choice to work from their home, their office, or both (in the country advertised). This permanent workplace flexibility program is consistent and fair globally, to help us find incredible talent, virtually anywhere. We are happy to discuss working options for this role and encourage you to speak with your recruiter in more detail when you apply.\n\nLearn what makes Akamai a great place to work\nConnect with us on social and see what life at Akamai is like!\n\nWe power and protect life online, by solving the toughest challenges, together.\nAt Akamai, we're curious, innovative, collaborative and tenacious. We celebrate diversity of thought and we hold an unwavering belief that we can make a meaningful difference. Our teams use their global perspectives to put customers at the forefront of everything they do, so if you are people-centric, you'll thrive here.\nWorking for you\nAt Akamai, we will provide you with opportunities to grow, flourish, and achieve great things. Our benefit options are designed to meet your individual needs for today and in the future. We provide benefits surrounding all aspects of your life:\nYour health\nYour finances\nYour family\nYour time at work\nYour time pursuing other endeavors\nOur benefit plan options are designed to meet your individual needs and budget, both today and in the future.\nAbout us\nAkamai powers and protects life online. Leading companies worldwide choose Akamai to build, deliver, and secure their digital experiences helping billions of people live, work, and play every day. With the world's most distributed compute platform from cloud to edge we make it easy for customers to develop and run applications, while we keep experiences closer to users and threats farther away.\nJoin us\nAre you seeking an opportunity to make a real difference in a company with a global reach and exciting services and clients? Come join us and grow with a team of people who will energize and inspire you!\n\nAkamai Technologies is an Affirmative Action, Equal Opportunity Employer that values the strength that diversity brings to the workplace. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of gender, gender identity, sexual orientation, race/ethnicity, protected veteran status, disability, or other protected group status.\nCompensation\nAkamai is committed to fair and equitable compensation practices. The base salary for this position ranges from $77,487 - $116,021/year; a candidate’s salary is determined by various factors including, but not limited to, relevant work experience, skills, certifications and location. The compensation package may also include incentive compensation opportunities in the form of annual bonus or incentives, equity awards and an Employee Stock Purchase Plan (ESPP). Akamai provides industry-leading benefits including healthcare, 401K savings plan, company holidays, vacation (in the form of PTO), sick time, family friendly benefits including parental leave and an employee assistance program including a focus on mental and financial wellness; Eligibility requirements apply."
    },
    {
        "title": "Software Engineer, Full Stack",
        "company": "Capital One - 3.9",
        "location": "Cambridge, MA",
        "link": "https://www.simplyhired.com/out?r=Xg20EyVgW_ykSuVI8BEJMRPff3RkAeV6Oq0RCrZym5-CRy7Ndto8M6H6On-_S7iehQSp0Tpuk5pBHkA",
        "Estimated Salary": "Unknown",
        "description": "Center 2 (19050), United States of America, McLean, Virginia\nSoftware Engineer, Full Stack\nDo you love building and pioneering in the technology space? Do you enjoy solving complex business problems in a fast-paced, collaborative, inclusive, and iterative delivery environment? At Capital One, you'll be part of a big group of makers, breakers, doers and disruptors, who solve real problems and meet real customer needs. We are seeking Full Stack Software Engineers who are passionate about marrying data with emerging technologies. As a Capital One Software Engineer, you’ll have the opportunity to be on the forefront of driving a major transformation within Capital One.\nWhat You’ll Do:\nCollaborate with and across Agile teams to design, develop, test, implement, and support technical solutions in full-stack development tools and technologies\nShare your passion for staying on top of tech trends, experimenting with and learning new technologies, participating in internal & external technology communities, mentoring other members of the engineering community\nCollaborate with digital product managers, and deliver robust cloud-based solutions that drive powerful experiences to help millions of Americans achieve financial empowerment\nUtilize programming languages like Python, Container Orchestration services including Docker, Angular and a variety of AWS tools and services\nBasic Qualifications:\nBachelor’s Degree\nAt least 2 years of experience in software engineering (Internship experience does not apply)\nPreferred Qualifications:\n3+ years of experience in at least one of the following: JavaScript, Java, TypeScript, SQL, Python, or Go\n1+ years of experience with AWS, GCP, Microsoft Azure, or another cloud service\n2+ years of experience in open source frameworks\n2+ years of experience in Agile practices\nAt this time, Capital One will not sponsor a new applicant for employment authorization for this position.\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part-time status, exempt or non-exempt status, and management level.\nThis role is expected to accept applications for a minimum of 5 business days.\nNo agencies please. Capital One is an equal opportunity employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to sex (including pregnancy, childbirth or related medical conditions), race, color, age, national origin, religion, disability, genetic information, marital status, sexual orientation, gender identity, gender reassignment, citizenship, immigration status, protected veteran status, or any other basis prohibited under applicable federal, state or local law. Capital One promotes a drug-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1-800-304-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\nCapital One does not provide, endorse nor guarantee and is not liable for third-party products, services, educational tools or other information available through this site.\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC)."
    },
    {
        "title": "Software Engineer",
        "company": "Sunlight Technologies - 4.0",
        "location": "Suwanee, GA",
        "link": "https://www.simplyhired.com/out?r=LLLqAxeOLuPy03dEoTwZvTTFx3avU6ttq9RjU7voAy1n5eObJug5wsrvtvRSdDUpDy_UdS-MpK0C0fmUON82exjaydsVBtit5_b039yV1UxRXcW57U0Tc5LwWP8",
        "Estimated Salary": "$85,000 - $150,000 a year",
        "description": "Sunlight Technologies Inc is looking to Hire Full Time Software Developers. The ideal candidate will be responsible for developing high-quality Full Stack applications using Java, .NET, NodeJS and Front End Applications like Angular, React and others . They will also be responsible for designing and implementing testable and scalable code for our clients.\nResponsibilities\nDevelop quality software and web and mobile applications\nAnalyze and maintain existing software applications\nDesign highly scalable, testable code\nDiscover and fix programming bugs\nWork closely with the client managers and project managers to understand the requirements and develop code as needed\nDevelop Microservices and RestFul API's that integrate with Web and Mobile apps along with other third party applications.\nCode test and troubleshoot programs utilizing the appropriate programming technologies; architect and design key components across various platforms; perform systems integration.\nWork with other technical team members, our CTO, mobile developers, QA team and Account managers to understand technical and business requirements and develop software’s and systems that meet the requirements.\nWrite instructions to guide operating personnel during production runs; analyze, review and rewrite programs to increase operating efficiency and adapt program to new requirements; compile and write documentation of program development and subsequent revisions.\nDesign and Implement effective architectures to integrate multiple systems and solutions that improve overall operational and business efficiencies. Work with business teams to understand critical challenges, possible solutions and develop applications using various technologies to address these challenges and problems.\nQualifications\nMinimum Bachelor's degree or equivalent experience in Computer Science or related field with atleast 2 years of Work Experience (or)\nMasters Degree or equivalent in Computer Science or other STEM field\nDevelopment experience with programming languages\nSQL database or relational database skills\nUnderstanding of Agile process\nLocation:\nThe position will be primarily based out of our office in Atlanta, GA but the selected candidate should be willing to work for our clients Across the United States.\nWork Authorization:\nCandidates should be eligible to work in the United States. Sunlight can Sponsor for the eligible candidates.\nCompensation:\nAs per market standards.\nJob Type: Full-time\nPay: $85,000.00 - $150,000.00 per year\nBenefits:\nHealth insurance\nCompensation package:\nBonus opportunities\nSchedule:\n8 hour shift\nWork Location: Hybrid remote in Suwanee, GA 30024"
    },
    {
        "title": "Software Development Engineer",
        "company": "Intellibus Ventures LLC",
        "location": "Silver Spring, MD",
        "link": "https://www.simplyhired.com/out?r=V2Ibn_47jmBJFm5BgVX0hRyDqBZhye3O2Gl-3n8cU2yHXkSPzE-EglvNP0aws4oT0tuyOa1MQ3y55ySumwA5fO6hvg5W7oiM7WCpHzHvhL6HVTV0L75HTyG1aT1kkv3lxLpBSr5OtJQ",
        "Estimated Salary": "$65 - $75 an hour",
        "description": "Are you a Java Developer working at a Large Financial Institution and being told by your leadership that you are too hands on or detail oriented or think and work like a start-up?\nImagine working at Intellibus to engineer platforms that impact billions of lives around the world. With your passion and focus we will accomplish great things together!\nWe are looking forward to you joining our Platform Engineering Team.\nOur Platform Engineering Team is working to solve the Multiplicity Problem. We are trusted by some of the most reputable and established FinTech Firms. Recently, our team has spearheaded the Conversion & Go Live of apps which support the backbone of the Financial Trading Industry.\nWe are looking for Engineers who can\nWrite applications in Java using Object Oriented Design Principles\nCreate Java Spring Boot REST Services\nUse Java Streams API to work with real time data\nCreate a Java Thread Executor Pool to read & write from a Thread-safe queue\nUse Java Lambdas for use in Collections\nCreate Distributed Cloud Configuration with Spring Cloud\nCreate Circuit Breakers with Spring Cloud\nCreate a Database Integration via Hibernate or Spring Data\nOptimize business logic & SQL queries to enhance performance by 50+%\nSetup Kafka to support 10mm messages / hr throughput on 2KB payloads\nDeploy a Kafka Multi-AZ Cluster on AWS\nBuild Services that are Highly Available (Multi-AZ & Multi-Region)\nBuild Algorithms to Optimize Execution times and reduce end to end latency\nUse & Tweak Terraform Scripts to deploy Kubernetes Clusters with EKS\nNavigate & debug Java Apps on a Linux EC2 Instance\nWe work closely with\nJava 8\nREST-based Microservices\nHibernate ORM\nRelational Databases\nAWS\nKafka\nLinux / Unix\nOur Process\nSchedule a 15 min Video Call with someone from our Team\n4 Proctored GQ Tests (< 2 hours)\n30-45 min Final Video Interview\nReceive Job Offer\nIf you are interested in reaching out to us, please apply and our team will contact you within the hour.\nJob Type: Full-time\nPay: $65.00 - $75.00 per hour\nSchedule:\nMonday to Friday\nExperience:\nJava: 7 years (Preferred)\nRESTful API: 7 years (Preferred)\nUNIX: 7 years (Preferred)\nWork Location: In person"
    },
    {
        "title": "Software Engineer",
        "company": "Oracle - 3.8",
        "location": "Austin, TX",
        "link": "https://www.simplyhired.com/out?r=is-TMj4CYp9dOFJ4G5Ukp4uxp5-hUZ8AVBBwyFq6MTaIRlw2S_1gHx3CfWtAuhYUgojMZ5onheNlgan6GWOdpp7G-YMgwPy6T3M6e1vVicg76ZtfNRjtr49z96hoKG9cuIKFlC3j2nLW3PsA_otPnlbKpIn_bw",
        "Estimated Salary": "Estimated: $92.7K - $117K a year",
        "description": "Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.\nThe OCI Infrastructure Delivery Engineering team is building services and tools to accelerate the process by which OCI grows its compute and network capacity. The service will address all aspects of the physical asset lifecycle from planning and design, to delivery and, eventually, decommissioning enabling OCI to continue to grow its footprint in both existing regions and to entirely new regions.\nWe are looking for software engineers who are ready to tackle new challenges in designing, implementing and maintaining highly available and scalable services for managing physical assets throughout their lifecycle.\nAs a Software Engineer on this team, you will work at Oracle headquarters office in Austin, TX, you will be a major contributor in the design and implementation of the service. You will partner with product team, learn about the existing challenges, and influence the vision and direction. You will execute the entire software lifecycle – development, testing, CI/CD and production operations. You must balance between product feature development and production operational concerns like writing run books, ops automation, structured logging, instrumentation for metrics and events leveraging internal tooling at OCI.\nFrom a technology perspective, this is a greenfield development environment with a huge amount of autonomy, leaving us free to build and innovate while integrating with existing systems through well-established contracts.\nAbout You:\nYou are an experienced cloud engineer with a proven track record of delivering high-scale, high-impact solutions\nYou are obsessed with the customer, always exceeding expectations\nYou have excellent communication skills. You can clearly explain complex technical concepts\nYou are a disciplined engineer who understands the importance of high standards, never satisfied with mediocrity and constantly striving for excellence\nYou are comfortable with ambiguity in a chaotic and fluid environment\nYou are passionate about technology and are not afraid to defend your opinions or position with peers/superiors\n\nMinimum Qualifications\n1-3+ years of experience shipping scalable, cloud-native distributed systems\nBS in Computer Science, or equivalent experience\nAbility to work in a collaborative, cross-functional team environment\nStrong grasp of Computer Science concepts (data structures, algorithms, and programming paradigms)\nProficient in Java, Python or Go\nExperience developing customer-focused architectures and restful web services\nAble to effectively communicate technical ideas verbally and in writing (technical proposals, design specs, architecture diagrams and presentations)\nPreferred Qualifications\nExperience in a fast-paced environment\nUnderstanding of key performance indicators and how to dig into them\nExperience in diagnosing, troubleshooting and resolving performance issues in complex environments\nExperience working with internal customers and translating requests into prioritized work or features\nUnderstanding of physical asset lifecycle within a cloud-scale datacenter\n\nAs a member of the software engineering division, you will apply basic to intermediate knowledge of software architecture to perform software development tasks associated with developing, debugging or designing software applications or operating systems according to provided design specifications. Build enhancements within an existing software architecture and occasionally suggest improvements to the architecture."
    },
    {
        "title": "Senior Developer (React + .NET)",
        "company": "MNK INFOTECH INC",
        "location": "Pittsburgh, PA",
        "link": "https://www.simplyhired.com/out?r=CG6SdMl7kxAIdqNV66y9uBWzXYgHh6F0ktspwcBjv3Z1yak63WoXyP5ZMBWkscCPkgmC5QpVQ3wtfNxvDmgKl5TlY2h2ugWzHmM3k38BFtAeqCRwNth8SRWZ5Fon9e07lVbrcgs",
        "Estimated Salary": "Estimated: $93.9K - $119K a year",
        "description": "Looking for Senior Developer (React+.NET) with one of our prime clients.\nLocation: Pittsburgh,PA\nOnsite role\nFull Time Employment (Direct hire) - Attractive Salary+ Benefits\ncan do contract C2C, if candidate is ready to relocate and be onsite.\nOpen to all work Authorizations\nMultiple Positions\nJob Description:\nWe are seeking a highly skilled Senior Full Stack Developer with a primary focus on React.js and complementary experience in .NET to join our dynamic team. The ideal candidate should possess an exceptional level of expertise in architecting and developing frontend applications using React while also demonstrating proficiency in integrating these applications with robust backend solutions in the .NET framework. This role requires a strong leader and individual contributor who can guide development teams, contribute proactively to complex projects, and ensure the delivery of high-quality, scalable solutions.\nResponsibilities\n● Lead and coordinate software development activities\n● Provide technical leadership to the development team\n● Code reviews and low level design reviews of developers\n● Coding of complex enhancements and features\n● Work closely with developers and QA team to build quality products\n● Collaborate with other members of their engagement teams\n● Demonstrate and apply a thorough understanding of complex information systems and technology\norganizations\n● Performs other duties as assigned or apparent\nQualifications\nFrontend Skills (React):\n● Extensive proficiency in React.js, leveraging its ecosystem, handling complex state management, and architecting scalable frontend solutions.\n● Thorough understanding of modern JavaScript, ES6/ES7, JSX, and related frontend technologies.\n● Proven experience in building interactive, user-friendly interfaces and optimizing frontend performance.\nBackend Skills (.NET):\n● Strong understanding of .NET framework, C#, ASP.NET MVC/Core, Entity Framework, and RESTful API development.\n● Knowledge of database technologies like SQL Server or other relational databases.\n● Experience in implementing security measures and authentication systems within .NET applications.\nLeadership and Team Management:\n● Demonstrated experience in leading development teams, providing technical guidance, and mentoring junior developers.\nJob Type: Full-time\nApplication Question(s):\nWhere are you based out of ?\nWhat is your work authorization?\nAre you available for quick call to discuss more about this opportunity?\nHow many years of experience you have in React?\nHow many years of experience in .NET?\nAre you ok to go onsite to client's location Harrisburg,PA(Locals are preferred)\nExperience:\nSenior Developer(.NET+React): 8 years (Preferred)\nWork Location: In person"
    },
    {
        "title": "Full Stack Java Springboot / Angular",
        "company": "EX2 Outcoding",
        "location": "Remote",
        "link": "https://www.simplyhired.com/out?r=fqslTikKUiC0cDHCoe9A5vQbZJqM5FqlOgXjspjrcneHsiVAGqtAC_50_NYiR5Wp7J-GtTo-KDP-hyJ_dmpOnyvBEbOghOnaxd1QLTlZNzK-dCDy3rhcO-Dq1ddJrK7lm2Wx19r5N6Mu2lDwumPAzUU",
        "Estimated Salary": "Estimated: $99.4K - $126K a year",
        "description": "Convierte en un Outcoder como un Full Stack Developer\n\nQue necesitas para ser exitosx?\n3 años minimo de experiencia como Full Stack utilizando Java Spring-boot y Angular con Material o Bootstrap\nConocimiento de APIS y Microservicios\nConocimiento de librerías para manejo de archivos\nConocimiento de la Norma Técnica NTP 392.030-2:2015.\nAbout us: EX² Outcoding is a premier solution provider of a broad range of outsourcing services, combining proven expertise in technology and project execution for companies searching for high-quality software development solutions. We specialize in delivering the best technical solution and enhancing that solution creatively by working closely with stakeholders to understand the business context.\n#LI-ERICK #LI-REMOTE"
    },
    {
        "title": "Mts Software Engineer",
        "company": "NetApp - 4.1",
        "location": "San Jose, CA",
        "link": "https://www.simplyhired.com/out?r=mH0SIiwKFq8l4VNU2Tc_dRgA4zPIEVpuwP1OWIF5rmm2IBkUvU6StFEuUTf_BT65dzCHpHh09CO6BMk",
        "Estimated Salary": "$132,210 - $185,790 a year",
        "description": "About NetApp\n\nWe’re forward-thinking technology people with heart. We make our own rules, drive our own opportunities, and try to approach every challenge with fresh eyes. Of course, we can’t do it alone. We know when to ask for help, collaborate with others, and partner with smart people. We embrace diversity and openness because it’s in our DNA. We push limits and reward great ideas. What is your great idea?\n\"At NetApp, we fully embrace and advance a diverse, inclusive global workforce with a culture of belonging that leverages the backgrounds and perspectives of all employees, customers, partners, and communities to foster a higher performing organization.\" -George Kurian, CEO\nJob Summary\nNetApp is developing new portfolio of data-centric storage platforms and services to help the world's leading organizations harness their data in new and interesting ways. NetApp is bringing its industry leading, enterprise class data storage technologies into the world's biggest public clouds and the simplicity & flexibility of cloud into customer data centers.\nAs a software engineer you will work as part of an exceptionally talented engineering team responsible for driving product development and strategy. The overall focus of the team will be on delivering innovative technologies to address competitive market and customer requirements with enterprise-class product quality and time-to-market. The team will also be responsible for maintenance & enhancements to existing technologies & products.\nEssential Functions\nApply current software engineering skills and use up-to-date technologies to contribute to team deliverables\nContributions to Design, Coding, Debug & Test, Performance analysis & improvement tasks\nContributions to technical discussions within the immediate team and across functions\nBe a technical resource to other engineers and across functions\nWillingness to work on additional tasks and responsibilities that will contribute towards team, department and company goals.\nJob Requirements\nJob Requirements\nExperience with development with C/C++ in LINUX/UNIX environments\nExperience with applying standard software engineering practices\nProficient with systems engineering domain concepts such as computer architecture, operating systems, file systems, networking, algorithms & data structures\nAbility to work collaboratively with other engineers\nKnowledge of storage or cloud technologies is a plus\nStrong oral & written communication skills are a plus\nEducation\nRequires a minimum of 3 years of related experience\nA Bachelor of Science Degree in Electrical Engineering or Computer Science, a Master Degree or a PhD; or equivalent experience is required.\nEqual Opportunity Employer:\nNetApp is firmly committed to Equal Employment Opportunity (EEO) and to compliance with all federal, state and local laws that prohibit employment discrimination based on age, race, color, gender, sexual orientation, gender identity, national origin, religion, disability or genetic information, pregnancy, protected veteran status, and any other protected classification.\n\nUSA and Canada Residents Only:\nThe base salary hiring wage range for this position which the Company reasonably and in good faith expects to pay for the position in the specified geographic areas or locations, is $132,210 – $185,790. Final compensation will be dependent on various factors relevant to the position and candidate such as geographical location, candidate qualifications, certifications, relevant job-related work experience, education, skillset and other relevant business and organizational factors, consistent with applicable law. In addition, the position may include some of the following comprehensive benefits such Medical, Dental, Vision, Life, 401(K), Paid Time off (PTO), sick time, leave of absence as per the FMLA and other relevant leave laws, Company bonus/commission, employee stock purchase plan, and/or restricted stocks (RSU’s)."
    },
    {
        "title": "Software Programmer",
        "company": "Ford Office Technologies - 4.0",
        "location": "Connellsville, PA",
        "link": "https://www.simplyhired.com/out?r=Jk0XcAb3VYtYCsoA7NUaKn0I7fNJmAAtZWzQjoGcQis1U-hSXHs0dI9z-kE81XUJGVqtMovo2qRqja4kfWZ1i9AN6DHDVj2dnugxbvw8yIpxPbHjrN4oirCVKIEivdIFGVUymI5-UmBXi9ggw1abh9vBE9DiELz2iX_jNOL-8Nxt6cwROlZs87hvL72tV0SBNUvjYa69wCRynJQIGz_RlA",
        "Estimated Salary": "$45,000 - $53,000 a year",
        "description": "Description:\nJoin the area’s largest independent full-line authorized provider of the industry’s top-three manufacturers for copier, printer, and multi-function product (MFP) technology as a Software Programmer located in Connellsville, PA.\nWe are seeking a highly motivated and organized Software Programmer to join our team.\nResponsibilities:\nCode and test programming for proprietary software.\nExecute code builds to test in production environments.\nFix bugs in new code.\nMaintain documentation according to coding best practices.\nDeploy and maintain proprietary Apps to staff computers.\nDocument software designs, technical specifications, and development processes.\nRequirements:\nCapabilities:\nCandidate should be a self-starter.\nAbility to write clean, well-documented code and support documentation.\nExcellent complex problem-solving skills.\nSolid troubleshooting and effective communication skills.\nDemonstrated analytical and critical thinking abilities.\nA track record of efficient, complete work with a sensitivity to tight time constraints.\nMeticulous attention to detail and editing.\nDemonstration of if/then logical, linear thinking.\nAbility for sustained concentrated effort for high productivity and efficiency.\nAbility to follow directions accurately and to work with minimal daily supervision.\nExperience Requirements:\nOne or more years of coding experience.\nStrong experience with all languages: Angular and C#.\nPlus, hands-on experience with: HTML5, CSS3, JavaScript, Microsoft SQL Server.\nOUR COMPANY CORE VALUES\n** Positivity * Loyalty * Accountability * Innovation * Dependability **\nThese 5 Core Values are the focus of our company culture that allows Ford Office Technologies to fulfill our mission every single day. Our values unite everyone toward a common goal and provide the foundation for a team environment that supports “what’s next” as we expand and grow the company, and the team.\nFor interest and more position details: Contact Ford's HR Department - Nicole Ross, HR Manager at (724) 691-6928."
    },
    {
        "title": "Producer",
        "company": "Metaverse Game Studios",
        "location": "Remote",
        "link": "https://www.simplyhired.com/out?r=Md9ffaVD6fp1wnj-k06Pu9ZD1yQAwfRhqoDULH3rIh0sjKmxRp-8b8rzvisuEitMfL0kwsPxj6IzOh5EuhUHfYPXw438e9OdKMG7jbmr5_dqAyNj4VMpI-FpsTrp76NzbE-AEOCHG-ZvWs4OXJg",
        "Estimated Salary": "Estimated: $72.4K - $91.7K a year",
        "description": "Metaverse Game Studios, Inc\n\nSt. Petersburg, Florida / Remote Team\n\nMetaverse is a young and independent game development company led by industry veterans who worked for core games such as Far Cry, Destiny, Halo series, Warface, League of Legends, Diablo Immortal, Mount&Blade series, Metro Exodus, and more. We are developing Angelic, which has an equal emphasis on storytelling and party-based RPG elements, all backed by a dark and compelling science-fiction setting in which you are often mesmerized by the complexity of the events happening around you.\n\nIf you are up to a challenge and want to deliver unforgettable RPG experiences to players around the world, our family is ready to welcome you!\nPLEASE APPLY IF ONLY YOU ARE INTERESTED IN A FULL TIME POSITION - NO OUTSOURCE ARTISTS OR STUDIOS.\nAngelic\nAngelic combines turn-based strategy combat with a narrative RPG, all backed by a collaboratively crafting science-fiction setting thanks to blockchain technology. Get ready to shape a massive conflict in the dark and compelling universe of Angelic.\nIt will not be an easy journey, and each action will have deep echoing repercussions. But don't worry, you won't have to do it alone.\nJob Description\nResponsibilities\nDefine, present and follow up on the project's development strategy and processes\nBuild and manage the project teams efficiently together with the core team to deliver and operate a high-quality game\nForm and manage the project's roadmap, resourcing plan, schedule, and budget\nManage and report the P&L of the project, in collaboration with other teams within the studio\nManage risks and contingency plans\nCoordinate the work with the core team and directly lead people reporting to you – you challenge people and foster productivity as well as act as a role model, mentoring and coaching your team members\nRecruit and retain talent in the team through promoting positive and transparent communication, and a safe environment with a culture of innovation\nRepresent the project inside and outside of the studio together with other core team members\nQualifications\nYour skills and experience\n2+ years of experience in the production of video games\nYou have shipped at least one AAA title either on PC and/or console from start to end\nExcellent knowledge of production, difficulties generally encountered by the teams, and solutions tailored to their requirements.\nYou have strong experience in building and leading high performing teams\nGame development tools and methodology knowledge and work experience (Jira, etc.) Analytical skills required to optimize the budget and manage schedules and project resources to achieve desired results\nStrong ability to collaborate with multiple international teams, both internal and external\nExcellent interpersonal skills and great verbal and written communication skills in English\nUp to date knowledge in different game genres\nSeveral years of experience in the production of video games and experience of shipping high-quality games as a Producer/Project Leader with full P&L responsibility\nExcellent understanding of game development processes and their various phases – ideally from conception to live\nHigh-level leadership skills – the ability to drive results while inspiring and motivating others\nSkills in coaching and mentoring team members and helping others to grow\nStrong expertise in project management tools and techniques and the ability to create structures, plans, budgets, and reports\nUnderstanding of key business concepts in the gaming industry and an ROI-driven mindset\nDriven and persistent attitude\nStrong interpersonal and communication skills\nOrganized and systematic working style, yet flexible in changing\n\n\nIf you are interested in creating something new in game development space, this is your chance to be part of something huge! Apply now and get the inside scoop on our new and exciting game IP!\n\nThis new opportunity and experience we're offering could be the open door you've been looking for to a new universe for you.\n\nEven if you don't fit all the requirements above, if building new systems, especially within game design and development is your passion, and you have a strong willingness to learn – don't hesitate to apply anyways, and let us know how you can contribute.\n\nDiversity and Inclusion\n\nDiversity and inclusion are very important for us. The creative potential and hard work of all our team members is what matters to us. You can be anyone or even any-thing, and as long as you're helping us create this amazing product we all love, you're more than welcome in our team. Moreover, diversity brings out creativity and it's valued and cherished at Metaverse Game Studios."
    },
    {
        "title": "Senior Full Stack Engineer",
        "company": "Fidelity Investments - 4.0",
        "location": "Durham, NC",
        "link": "https://www.simplyhired.com/out?r=tHIfHQgKP8Bxi_P7rXyUaXOagUM8bGjzCaPr_8w2rmAUaO4edwaToLPFoNihbm5mMIMPQzWR2vizUDM",
        "Estimated Salary": "Estimated: $100K - $127K a year",
        "description": "Job Description:\nThe Role\nFidelity Workplace Investing Associate Experience & Service Strategy is looking for a Senior Software Engineer who will work within a team based agile model to deliver features and functionality for a large group of associates to help and support our customers. The team is passionate about delivering functionality that Empowers WI associates to deliver better experiences for our customers.\nYou'll have the opportunity to contribute ideas to improve our products as well as develop your skills, learn new technologies and languages, and continue to learn. We're looking for highly motivated individuals who work well in a collaborative, iterative, and fast-paced environment.\n\nThe Expertise and Skills You Bring\nYou will be playing a hands-on role on our team\nParticipate in technical discussions and recommend optimal path forward\nYour focus will be migrating an existing suite of Desktop Applications across multiple technology stacks including Microsoft .NET / C#, WPF, SOAP, REST APIs to an Angular, JAVA tech stack.\nUse your experience and knowledge to influence better software design, promote accurate software engineering and bug prevention strategies, testability, and security\nYou will also be directly involved in building new and improving capabilities on modern web-based tech stacks that will help Fidelity continue to deliver industry best experiences.\nAppreciation for and alignment to standard methodologies regarding object-oriented design, coding standards, RESTful service consumption and integration, common design patterns, secure application development, and test coverage\nBachelor’s degree in Computer Science or a related technology field\n5+ years of proven software development experience\nRobust critical thinking skills coupled with a desire for growth, to learn and to engage with peers in technical and design discussions\nExperience with Angular, NodeJS, Ag-grid and TypeScript.\nProven experience with Spring Frameworks, Spring Boot and JAVA Programming Language (Java 1.8+)\nAbility to work effectively in global teams distributed across geographic locations in an Agile way\nCertifications in Azure or AWS cloud platforms are a plus\nExposure to Docker and Azure DevOps\nKnowledge of API gateways (Apigee preferred)\nHands-on experience utilizing Agile delivery methodology and participating in story writing, backlog refinement, and all Squad Scrum ceremonies\nSeeing complex challenges from multiple perspectives, and leaning in to solve independently or with peers\nYou bring an understanding of Micro-services Architecture and domain driven design patterns\nDedication to high quality, balanced with rapid pace of delivery\nThe Team\nAt Fidelity, you can find it all here. We reward ambitious, passionate individuals with a work environment that fosters diversity, teamwork and collaboration as well as encourages innovative ideas and fresh thinking. We recognize the value that employees’ individual differences can contribute to the bright and strong future of our company.\nCertifications:\nCompany Overview\nFidelity Investments is a privately held company with a mission to strengthen the financial well-being of our clients. We help people invest and plan for their future. We assist companies and non-profit organizations in delivering benefits to their employees. And we provide institutions and independent advisors with investment and technology solutions to help invest their own clients’ money.\n\nJoin Us\nAt Fidelity, you’ll find endless opportunities to build a meaningful career that positively impacts peoples’ lives, including yours. You can take advantage of flexible benefits that support you through every stage of your career, empowering you to thrive at work and at home. Honored with a Glassdoor Employees’ Choice Award, we have been recognized by our employees as a Best Place to Work in 2023. And you don’t need a finance background to succeed at Fidelity—we offer a range of opportunities for learning so you can build the career you’ve always imagined.\nAt Fidelity, our goal is for most people to work flexibly in a way that balances both personal and business needs with time onsite and offsite through what we’re calling “Dynamic Working”. Most associates will have a hybrid schedule with a requirement to work onsite at a Fidelity work location for at least one week, 5 consecutive days, every four weeks. These requirements are subject to change.\nWe invite you to Find Your Fidelity at fidelitycareers.com.\n\nFidelity Investments is an equal opportunity employer. We believe that the most effective way to attract, develop and retain a diverse workforce is to build an enduring culture of inclusion and belonging.\nFidelity will reasonably accommodate applicants with disabilities who need adjustments to participate in the application or interview process. To initiate a request for an accommodation, contact the HR Accommodation Team by sending an email to accommodations @fmr.com, or by calling 800-835-5099, prompt 2, option 3.\nAt Fidelity, we value honesty, integrity, and the safety of our associates and customers within a heavily regulated industry. Certain roles may require candidates to go through a preliminary credit check during the screening process. Candidates who are presented with a Fidelity offer will need to go through a background investigation and may be asked to provide additional documentation as requested. This investigation includes but is not limited to a criminal, civil litigations and regulatory review, employment, education, and credit review (role dependent). These investigations will account for 7 years or more of history, depending on the role. Where permitted by federal or state law, Fidelity will also conduct a pre-employment drug screen, which will review for the following substances: Amphetamines, THC (marijuana), cocaine, opiates, phencyclidine.\nWe welcome those with experience in jobs such as Software Developer, Computer Technician, and Computer User Support Specialist and others in the Computers and Technology to apply."
    },
    {
        "title": "Fullstack Developer",
        "company": "Subconscious.ai - 3.0",
        "location": "Remote",
        "link": "https://www.simplyhired.com/out?r=0JSLIZNu9Y5xJRORFG2ZDXGenEIMRC4M79cGeC_0skmsyU6h9ZQlfmheOHGYBhFT6-DQuNOxNQ5pRm4cQ33DWH3YYGmK8Nbyv-5tipV_886sinQD8b1qs1cg6x0noqlYi_tS-VhfDGTWWm0DGdA0aGXb",
        "Estimated Salary": "Estimated: $99K - $125K a year",
        "description": "Subconscious.ai (https://subconscious.ai/) radically accelerates Market Research by augmenting humans market survey responses with synthetic respondents. By replicating hundreds of published experiments we have proven a 100x cost reduction and 1,000x time reduction vs traditional research methods like consultants and quantitative surveys while maintaining near-human (85% - and growing) accuracy.\n\nOur stack consists of tech like Langchain, Autogen, React, WANDB, Meilisearch, Causalx, Llama, OpenAI, OpenAPI, Cohere, Python, R, hosted on GCP/Azure.\nCompany Description\nSubconscious AI is a technology company that allows users to conduct causal experiments for any human behavior at a fraction of the cost and time of traditional methods. Our mission is to help people conduct research faster, with higher quality, and more ethically.\nWe're looking for talented individuals who share our values and are excited to take part in this cutting-edge field.\n\nRole Description\nThis is a full-time remote role for a Full Stack Engineer. As a Full Stack Engineer at Subconscious AI, you will be responsible for developing and maintaining both the front-end and back-end of our research platform. Your day-to-day tasks will include designing and implementing new features, debugging issues, and working with our team to develop creative solutions to complex problems. You will also be expected to stay up-to-date with the latest technologies and work collaboratively with other members of our team to continuously improve our product.\n\nKey Responsibilities\nDevelop and maintain scalable server-side logic using Python.\nDesign and implementation of APIs.\nImplement front-end components with responsive UI design.\nIntegrate user-facing elements with server-side logic.\nWrite reusable, testable, and efficient code.\nQualifications\nBachelor's degree in Computer Science, Engineering or a related field, or equivalent experience.\n3+ years of experience in Python development.\nExperience with cloud platforms (e.g., GCP, Azure), CI/CD pipelines, and Github.\nExcellent communication and teamwork skills.\nGreat attention to detail and organizational skills.\nNice to Have\nExperience with Python, Github, OpenAPI, RabbitMQ, R, Langchain, Autogen, React, WANDB, Meilisearch, Causalx, Llama, OpenAI, OpenAPI, Cohere, GCP & Azure.\nTo speak with the team, join our Discord here: https://discord.gg/3bgj4ZhABz"
    },
    {
        "title": "Software Developer",
        "company": "Oracle - 3.8",
        "location": "California",
        "link": "https://www.simplyhired.com/out?r=TIiGAX9q04cI8EBdXk2i5oB3rxS2CS5VsSn6y6aqklNkGmL9ssr9F8s-kDfHtbfQxZhwRJIo8AbUdzNi9nsE5kf4TUBaWtGbBjwwla9ma4otthCyjooteOIIyx04nZJ0Aav5u-VLZrZwQ9Z5d9NcdxNXmqPwyg",
        "Estimated Salary": "Estimated: $138K - $175K a year",
        "description": "Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.Are you interested in working on the Storage Infrastructure team that operates with Exabytes of data in 60+ regions? Oracle Cloud Infrastructure (OCI) customers run their businesses on our cloud, and our mission is to provide them with industry-leading computing, storage, networking, database, security, and an ever-expanding set of foundational cloud-based services. Our team seeks senior, hands-on engineers with expertise and passion for solving complex problems in distributed systems, large-scale storage, and scaling services to meet future growth. If this is you, you can be part of the team that drives the best-in-class Storage platform into its next development phase. These are exciting times for the service - we are growing fast and delivering innovative, enterprise-class features to satisfy various customer workloads.\nAs a senior member of the Block Storage Data plane team, you will own the software design and development for multiple core components and features on the core I/O path of the Block Storage Service. It would be best if you were a strong programmer and a distributed systems generalist, able to dive deep into any part of the stack and low-level systems and design broad distributed system interactions. You should value simplicity and scale, work comfortably in a collaborative, agile environment, and be excited to learn.\nhttps://www.oracle.com/cloud/storage/block-volumes/\n\nAs a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. You will be responsible for defining and developing software for tasks associatWe’re looking for hands-on senior engineers with expertise and passion in solving difficult problems in distributed systems, virtualized infrastructure, and highly available storage services. As a Principal Member of Technical Staff, you will own the software design and development for major components of the Block Storage Service Infrastructure. You should be both a rock solid coder and a distributed systems generalist, able to dive deep into any part of the data plane stack and low level systems, as well as design broad distributed system interactions. You should value simplicity and scale, work comfortably in a collaborative, agile environment, and be excited to learn.\nMinimum Qualifications:\n8+ years experience delivering large scale, highly available distributed systems and backend services.\nExtensive experience with systems design and developing clean code in C++ and scripting languages such as Python, etc.\nStrong knowledge of data structures, algorithms, multi-threading, I/O paths, operating systems, and distributed systems fundamentals.\nStrong understanding of block storage systems and distributed persistence technologies.\nWorking familiarity with networking protocols (TCP/IP, HTTP) and standard network architectures.\nStrong troubleshooting and performance tuning skills.\nExperience building multi-tenant, virtualized storage infrastructure, data management\nAs part of Oracle’s employment process candidates will be required to complete a pre-employment screening process, after a conditional offer has been extended.\nOracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.\n\ned with the developing, designing and debugging of software applications or operating systems."
    },
    {
        "title": "Web Developer",
        "company": "End Time Harvest Entertainment Studios",
        "location": "Minneapolis, MN",
        "link": "https://www.simplyhired.com/out?r=bEo5V5pW6Q329tB2MwuG58E8DDEeUhwjvmJQON9mVo6p7ubpVnJrl5ugR0ogwqCNzrKbTegq0cXpELwRvH5ctSdCzKJqgiUc8GrnDu110-Ve1kxX0yaAPg",
        "Estimated Salary": "Estimated: $41.6K - $52.7K a year",
        "description": "This is a summer 2019 internship position.\nThe role is responsible for designing, coding and modifying ETH websites, from layout to function and according to a client's specifications. Strive to create visually appealing sites that feature user-friendly design and clear navigation.\nThe position requires constant communication with colleagues.\nExperience in planning and delivering software platforms used across multiple products and organizational units.\nSome Web Developer Skills and Qualifications:\nJavaScript, JQuery, HTML, HTML5, CSS, CSS3, Web Programming Skills, E-Commerce, Teamwork, Verbal Communication, cross-browser compatibility, Web User Interface Design (UI), Security Principles, Object-Oriented Design, Web Services (REST/SOAP), Multimedia Content Development, API's\nStipend Only\nJob Types: Part-time, Internship\nJob Types: Part-time, Internship\nSchedule:\n8 hour shift\nMonday to Friday\nWeekends as needed\nEducation:\nHigh school or equivalent (Preferred)\nExperience:\nFront-end development: 1 year (Preferred)\nCSS: 1 year (Preferred)\nAngular: 1 year (Preferred)\nWork Location: In person"
    },
    {
        "title": "Chapter Leader - Full Stack Engineering",
        "company": "Fidelity Investments - 4.0",
        "location": "Westlake, TX",
        "link": "https://www.simplyhired.com/out?r=1CpmeshyDSGytklQP5DI7lvbgCI70ehmZ5EvS7yYKWfOmU_DB-c-sErjMIRS8NdUI23pGRdMmOc-9uM",
        "Estimated Salary": "Estimated: $119K - $151K a year",
        "description": "Job Description:\nThe Purpose of This Role\nOur teams build and contribute to Fidelity’s digital presence. As a Chapter Lead of software engineering, you will lead teams to develop omni channel capabilities and the underlying platforms needed to support our digital presence. You’ll work on building entire features, taking these from concept to deployment, as part of our autonomous, cross functional teams. You'll have the opportunity to contribute ideas to improve our products as well as develop your skills, learn new technologies and languages, and continue to learn. We're looking for highly motivated individuals who work well in a collaborative, iterative, and fast-paced environment.\n\nThe Value You Deliver\nWith you as a core member of the technology leadership team, we will together continue to drive and enhance a strong engineering culture that is built on these foundational principles:\nImagine. Innovate. Inspire. Keep it cool: Cultivate an inclusive organizational culture, champion positive energy & family spirit, recognize greatness, support each other & enjoy the journey.\nElevate the floor; Influence the horizontal: Commit to developing leadership at all levels. Help your peers & team get better by raising standards within and around while maintaining a strong focus on building future leaders.\nTightly aligned; loosely coupled: Establish or enhance partnerships across the organization to ensure alignment towards enterprise standards, tools and reusability while providing direction for teams to operate autonomously.\nLevel Up on Craftsmanship: Treat learning as a journey not a destination. Commit to learning and guiding as a part of your life.\nBuild the \"Best\" Tech together: Promote innovation driven by purpose and practicing autonomy with responsibility.\nThe Skills that are Key to this role\nDrive and motivation to shape and service our broader organization by providing leadership, strategic thought consulting, and leading digital transformation efforts to support an agile workforce that is focused on customer obsession, pace over perfection, leadership at all levels and continuous learning.\nAspiration and skills to drive technology roadmaps for establishment and rollout of engineering standards, technology direction, and product architecture allowing the business leaders to develop key insights to optimally manage the business today and in the future.\nTechnology chops to be immersed in the very leading edge of cloud, web and mobile technologies, plying your know-how with cutting edge architecture, and modern development practices.\nAuthenticity and personal commitment to coach engineers across multiple levels, craft frameworks for skills progression, influence careers, and build leadership skills.\nBachelor’s Degree in Computer Science, Information Science (or equivalent STEM subject area)\nOwn all technical aspects of software engineering for assigned applications.\nWrite codes and perform tests of applications.\nProvide hands on expertise with architecture, technical design and performance tuning on development tasks in ongoing sprints.\nDevelop deep understanding of the tie-ins with other systems and platforms within the supported domains.\nWork closely with product owners on blueprints and annual planning on feature sets that impact multiple platforms and products.\nDrive ongoing product and platform release sprints with various team members and business stake holders.\nMentor Engineers on Agile team and implement high-quality software components.\nFind opportunities to adopt innovative technologies.\nTechnical / Behavioral\nTechnology leadership, critical thinking, and influencing skills across diverse organizational structures.\nDriving technology architecture, strategies & product roadmaps for large, complex systems.\nStrong knowledge of cloud-based technologies specifically the AWS platform.\nHands on experience on API Design & Development and MicroServices Architecture.\nStrong programming skills with digital mindset, and fluent across technology components including API Services development and consumption using modern frameworks and open source technologies.\nThe ability to code in more than one programming language and experience with architectural patterns of large, high-scale applications. We believe in applying the right technology depending on the challenge, and are always exploring new technologies to continually provide value to our customers.\nApply state-of-the-art tools and methods to enable efficiency, performance and agility through automating DevOps processes, continuous integration and delivery pipelines.\nDeep understanding of building secure software using modern security principles. Everything we build is under threat. Being aware of attacks and mastering your defences are integral to safeguarding the trust our customers place on us.\nDelivery focus with the ability to take full ownership\nExperience working with distributed teams in different time-zones\nStrong commitment to quality, documentation and engineering excellence\nStrong communication skills, problem solving skills and adaptability\nExperience in reverse engineering and understanding existing applications\nWillingness to learn new technologies\nJava/J2EE Object Oriented design and development skills.\nCore Java, Servlets/JSP, Spring. Java Script, jQuery\nWeb Services (SOAP, REST).\nAbility to participate in working sessions that result in clear requirements and technical design, even when working with non-technical members of SCRUM teams.\nProven experience with Continuous Integration concepts and DevOps best-practices & tools (Maven, Jenkins, GitHub, Jira, etc.)\nUnix and Shell scripting basics is a plus\nMultithreading basics and Java design patterns is a plus\nStrong analytical and interpersonal skills\nExcellent oral and written communication skills\nQuick learner and willing to adapt and learn new technologies\nGreat attitude, team player and effective contributor\nCommitment to quality and high standards\n\nThe Skills that is good to have for this role\nStrong time management and planning skills required.\nPossess excellent communications and interpersonal skills.\nThe Expertise We’re Looking For\nBachelor’s degree in Computer science or any other subject area\n14+ years of experience in Java API, Web and Cloud technology role\nCertifications:\nCompany Overview\nFidelity Investments is a privately held company with a mission to strengthen the financial well-being of our clients. We help people invest and plan for their future. We assist companies and non-profit organizations in delivering benefits to their employees. And we provide institutions and independent advisors with investment and technology solutions to help invest their own clients’ money.\n\nJoin Us\nAt Fidelity, you’ll find endless opportunities to build a meaningful career that positively impacts peoples’ lives, including yours. You can take advantage of flexible benefits that support you through every stage of your career, empowering you to thrive at work and at home. Honored with a Glassdoor Employees’ Choice Award, we have been recognized by our employees as a Best Place to Work in 2023. And you don’t need a finance background to succeed at Fidelity—we offer a range of opportunities for learning so you can build the career you’ve always imagined.\nAt Fidelity, our goal is for most people to work flexibly in a way that balances both personal and business needs with time onsite and offsite through what we’re calling “Dynamic Working”. Most associates will have a hybrid schedule with a requirement to work onsite at a Fidelity work location for at least one week, 5 consecutive days, every four weeks. These requirements are subject to change.\nWe invite you to Find Your Fidelity at fidelitycareers.com.\n\nFidelity Investments is an equal opportunity employer. We believe that the most effective way to attract, develop and retain a diverse workforce is to build an enduring culture of inclusion and belonging.\nFidelity will reasonably accommodate applicants with disabilities who need adjustments to participate in the application or interview process. To initiate a request for an accommodation, contact the HR Accommodation Team by sending an email to accommodations @fmr.com, or by calling 800-835-5099, prompt 2, option 3.\nAt Fidelity, we value honesty, integrity, and the safety of our associates and customers within a heavily regulated industry. Certain roles may require candidates to go through a preliminary credit check during the screening process. Candidates who are presented with a Fidelity offer will need to go through a background investigation and may be asked to provide additional documentation as requested. This investigation includes but is not limited to a criminal, civil litigations and regulatory review, employment, education, and credit review (role dependent). These investigations will account for 7 years or more of history, depending on the role. Where permitted by federal or state law, Fidelity will also conduct a pre-employment drug screen, which will review for the following substances: Amphetamines, THC (marijuana), cocaine, opiates, phencyclidine.\nWe welcome those with experience in jobs such as General, General, and General and others in the General to apply."
    },
    {
        "title": "Web Developer",
        "company": "Citirex",
        "location": "Los Angeles, CA",
        "link": "https://www.simplyhired.com/out?r=DU-64wTXYGv0k4eWhvy1-CVZFd0B63tdmt4f9R24AvhNQeIarA3fviC88eE0KwRH8ZmU13a7kmeggMm_yOPFXdn0O7cxYakZ6pUbOTQ",
        "Estimated Salary": "Estimated: $62.6K - $79.2K a year",
        "description": "CITIREX is always seeking motivated and talented individuals to join our growing team. Use the contact form to contact HR about any open position, or send an email to hr@citirex.com.\nWeb Developer - Los Angeles\nDescription\nCitirex is seeking a motivated and talented individual to join our growing team at our location in Los Angeles. We are looking for a creative web designer with the current knowledge and technical skills to interpret our clients needs and to design solutions with high visual impact.\nDesired Skills & Experience\n2+ year’s of Design experience – Web;\nProficiency with HTML, CSS;\nExperience with Responsive Design;\nProficient with the WordPress CMS;\nKnowledge of Javascript, JQuery, PHP, Databases and Data Management."
    },
    {
        "title": "Website and Mobile App Developer",
        "company": "Villain Arts",
        "location": "Philadelphia, PA",
        "link": "https://www.simplyhired.com/out?r=YSgobWoVD_rTi-qZVzYWTDVz_nWl7nStDF1q1ojL1JjjZlhGQ1v3wMspI-N7g4U0KBvDucRgAL91nD4lpL3ESfz5H4xc-n2vmE5bo_Xf_4-BINxsR0BUFjl_BhhSrh_kxCEO8_CfUCSZ4jU",
        "Estimated Salary": "From $20 an hour",
        "description": "About us\nVillain Arts is one of the largest and most well known tattoo expos nationwide, hosting 27 (and counting) shows annually. We are a professional, inclusive, and creative business based in Philadelphia, Pennsylvania.\nOur work environment includes:\nModern office setting\nRelaxed atmosphere\nCasual work attire\nDo you have a passion and knowledge for web & app development and a love for tattoos? We are looking for someone to join our team and assist in developing an online booth registration system, as well as an app to help match clients to artists at our events.\nResponsibilities:\n- Develop, test, and maintain software applications using various programming languages and technologies.\n- Collaborate with cross-functional teams to gather requirements and design solutions.\n- Write clean, efficient, and maintainable code.\n- Troubleshoot and debug issues in existing applications.\n- Stay up-to-date with emerging technologies and industry trends.\nExperience:\n*Please attach your resume and a portfolio*\n- MUST HAVE completed education and/or related work history.\n- Excellent problem-solving and analytical skills.\n- Strong communication and collaboration abilities.\nPlease note that this job description is not exhaustive and additional responsibilities may be assigned as needed.\nJob Types: Full-time, Part-time\nPay: From $20.00 per hour\nExpected hours: 30 – 40 per week\nExperience level:\n2 years\nSchedule:\n8 hour shift\nEducation:\nHigh school or equivalent (Preferred)\nExperience:\nWeb development: 2 years (Preferred)\nApplication development: 2 years (Preferred)\nAbility to Commute:\nPhiladelphia, PA 19124 (Required)\nWork Location: In person"
    }
]